## [ 중복 데이터 처리 ]
- 중복 데이터 기준 ==> 행(row)
- 행 단위로 모든 컬럼의 값이 완전히 똑같은 데이터는 중복 데이터
- 처리 => 제거

(1) 모듈 로딩

In [44]:
import pandas as pd

(2) 데이터 준비

In [45]:
file = '../DATA/employees.csv'

(3) 데이터 저장 : CSV => DF

In [46]:
empDF = pd.read_csv(file)

(4) 데이터 확인

In [47]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

(5) 데이터 전처리 => 나. 중복 데이터 처리

- 중복 데이터 체크 => duplicated() : 중복이면 True
- 중복 데이터 처리 => drop_duplicate() : 삭제

In [48]:
# 행 단위로 완전히 똑같은 행 검사 ==> 0개
empDF.duplicated().sum()

0

In [49]:
# Team 컬럼 

# 이전에 나온 값들과 같은지 다른지 . 같다면 True 다르면 False
empDF.Team.duplicated().sum(), empDF.Team.nunique()
# 중복값 개수 , 유니크값 개수

(990, 10)

In [50]:
empDF

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

In [51]:
# 중복 데이터를 삭제시켜보자
empDF.Team.drop_duplicates(keep = False)

#empDF.drop_duplicates(subset = ['Team'])
#데이터프레임에서 중복값을 찾아서 삭제하려고 한다. 근데 그 찾는 열을 'Team'으로 설정해서 해보겠다

Series([], Name: Team, dtype: object)